/***********************************************************************************************************
* 7. Осуществить при помощи программ п. 6. обмен сообщениями между несколькими пользователями, при условии,
* что каждому пользователю предназначены сообщения любого или определенного типа (по договоренности).
* Будут ли примеры с очередями сообщений "приводить себя в порядок"? Что произойдет, если прервать
* процесс-сервер с помощью клавиши CTRL-C?
***********************************************************************************************************/

#include <stdio.h>

int main()
{

	return 0;
}
