/***********************************************************************************************************
* 6. Написать программы для работы с очередями сообщений в соответствии с моделью клиент-сервер:
* каждый процесс использует собственную очередь сообщений. Процесс-сервер читает запросы из своей очереди
* сообщений и посылает ответ процессам-клиентам в их очереди. Процессы-клиенты читают ответ и выводят его
* в выходной поток. Процессы-клиенты должны передавать процессу-серверу информацию о своих очередях сообщений
* (куда записывать ответ).
***********************************************************************************************************/

#include <stdio.h>

int main()
{

	return 0;
}
